tap "beeftornado/rmtree"

# CLI tools
brew "act"
brew "asdf"
brew "awscli"
brew "basedpyright"
brew "docker-credential-helper"
brew "fd"
brew "fzf"
brew "ffmpeg"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "mole"
brew "mysql"
brew "nmap"
brew "pandoc"
brew "pi-coding-agent"
brew "pinentry-mac"
brew "rename"
brew "sentry-cli"
brew "shellcheck"
brew "sops"
brew "temporal"
brew "uv"
brew "watch"
brew "wget"
brew "z"

# Apps
cask "aldente"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "arduino-ide"
cask "balenaetcher"
cask "bettertouchtool"
cask "bitwarden"
cask "blender"
cask "caffeine"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono"
cask "fork"
cask "ghostty"
cask "gimp"
cask "granola"
cask "handy"
cask "ia-presenter"
cask "iina"
cask "inkscape"
cask "libreoffice"
cask "linearmouse"
cask "mitmproxy"
cask "monitorcontrol"
cask "moonlight"
cask "ngrok"
cask "obsidian"
cask "openscad"
cask "orbstack"
cask "prusaslicer"
cask "raspberry-pi-imager"
cask "resilio-sync"
cask "rode-central"
cask "signal"
cask "slack"
cask "supacode"
cask "tailscale-app"
cask "telegram"
cask "the-unarchiver"
cask "tidal"
cask "todoist-app"
cask "transmission"
cask "trezor-suite"
cask "twist"
cask "ungoogled-chromium"
cask "whatsapp"
cask "zed"
cask "zight"
